pg_bench/postgresql_oltp_insert_threads_16_time_60_tables_4_table_size_1000000.log
sysbench --threads=16 --time=60 --report-interval=10 --db-driver=pgsql oltp_insert --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=4 --table-size=1000000 prepare >> postgresql_oltp_insert_threads_16_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest2'...
Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest2'
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest3'
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest2'...
sysbench --threads=16 --time=60 --report-interval=10 --db-driver=pgsql oltp_insert --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=4 --table-size=1000000 run >> postgresql_oltp_insert_threads_16_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 16746.67 qps: 16746.67 (r/w/o: 0.00/16746.67/0.00) lat (ms,95%): 1.76 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 18287.11 qps: 18287.11 (r/w/o: 0.00/18287.11/0.00) lat (ms,95%): 1.52 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 14459.76 qps: 14459.76 (r/w/o: 0.00/14459.76/0.00) lat (ms,95%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 13013.71 qps: 13013.71 (r/w/o: 0.00/13013.71/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 15646.49 qps: 15646.49 (r/w/o: 0.00/15646.49/0.00) lat (ms,95%): 1.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 15898.96 qps: 15898.96 (r/w/o: 0.00/15898.96/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           940654
        other:                           0
        total:                           940654
    transactions:                        940654 (15672.15 per sec.)
    queries:                             940654 (15672.15 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0198s
    total number of events:              940654

Latency (ms):
         min:                                    0.22
         avg:                                    1.02
         max:                                  180.81
         95th percentile:                        1.96
         sum:                               957571.23

Threads fairness:
    events (avg/stddev):           58790.8750/49.97
    execution time (avg/stddev):   59.8482/0.00

sysbench --threads=16 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=4 --table-size=1000000 cleanup>> postgresql_oltp_insert_threads_16_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...