pg_bench/postgresql_oltp_write_only_threads_8_time_60_tables_2_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_write_only --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 prepare >> postgresql_oltp_write_only_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest1'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_write_only --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 run >> postgresql_oltp_write_only_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 4497.90 qps: 26993.78 (r/w/o: 0.00/17994.69/8999.09) lat (ms,95%): 3.49 err/s: 0.60 reconn/s: 0.00
[ 20s ] thds: 8 tps: 6135.68 qps: 36817.48 (r/w/o: 0.00/24542.82/12274.66) lat (ms,95%): 2.14 err/s: 1.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 6086.41 qps: 36522.77 (r/w/o: 0.00/24346.25/12176.52) lat (ms,95%): 2.14 err/s: 1.30 reconn/s: 0.00
[ 40s ] thds: 8 tps: 6167.24 qps: 37005.74 (r/w/o: 0.00/24668.06/12337.68) lat (ms,95%): 1.93 err/s: 0.70 reconn/s: 0.00
[ 50s ] thds: 8 tps: 5559.23 qps: 33359.77 (r/w/o: 0.00/22238.51/11121.26) lat (ms,95%): 2.39 err/s: 0.70 reconn/s: 0.00
[ 60s ] thds: 8 tps: 5380.88 qps: 32287.79 (r/w/o: 0.00/21523.33/10764.46) lat (ms,95%): 2.48 err/s: 0.90 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1353155
        other:                           676751
        total:                           2029906
    transactions:                        338283 (5636.68 per sec.)
    queries:                             2029906 (33823.55 per sec.)
    ignored errors:                      52     (0.87 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0137s
    total number of events:              338283

Latency (ms):
         min:                                    0.33
         avg:                                    1.42
         max:                                  191.46
         95th percentile:                        2.39
         sum:                               479632.33

Threads fairness:
    events (avg/stddev):           42285.3750/152.78
    execution time (avg/stddev):   59.9540/0.00

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 cleanup>> postgresql_oltp_write_only_threads_8_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...